---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseA
source: html/8fb622de-8c08-ed41-8e2f-1ac3edb1edb1.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.ApparentCurrentPhaseA Property

The ApparentCurrentPhaseA value of the Electrical System.

## Syntax (C#)
```csharp
public double ApparentCurrentPhaseA { get; }
```

## Remarks
This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!